package Week05;
/*
*   N대의 자동 튀김기를 이용해 튀김을 한다.
*   i번째 자동 튀김기는 치킨을 한 번 튀기는 데에 fry[i] 만큼의 시간이 걸리며, 튀김이 한번 끝나면 clean[i] 만큼의 시간동안 자동 세척을 한다.
*   M 번 치킨을 튀겨내려고 할 때, 최소한 몇 시간 동안 자동 튀김기를 가동해야 하는지 계산하시오.

    입력설명
    0 < N <= 100000
    0 < M <= 100000
    0 < fry[i] <= 100
    0 < clean[i] <= 100

    출력설명
    자동 튀김기를 최소 몇 시간 가동해야 하는지 정수로 출력

    매개변수 형식
    N = 2
    M = 20
    fry = {3, 6}
    clean = {2, 1}

    반환값 형식
    58
* */


public class Test05 {
    public static void main(String[] args) {

    }
}
