package Test;
//  백준 2110번 - 공유기 설치 (https://www.acmicpc.net/problem/2110)
/*
*   입력 1. 첫째 줄에 집의 개수 N (2 ≤ N ≤ 200,000)과 공유기의 개수 C (2 ≤ C ≤ N)이 하나 이상의 빈 칸을 사이에 두고 주어진다.
*       2. 둘째 줄부터 N개의 줄에는 집의 좌표를 나타내는 xi (0 ≤ xi ≤ 1,000,000,000)가 한 줄에 하나씩 주어진다.
*
*   출력 1. 첫째 줄에 가장 인접한 두 공유기 사이의 최대 거리를 출력한다.
*
*   접근 방법
*       입력을 보면 수가 정렬되서 들어오지 않으므로, 단순 선형탐색으로는 비교하기엔 수가 너무 크다.
*       병합정렬이나 퀵, 힙을 이용해서 정렬한다 해도 정렬한 이후 재탐색을 해야 하므로 정렬 자체는 시간을 더 소요하게 된다.
* */


public class G_2110 {
    public static void main(String[] args) {

    }
}
